{
  "id": "cv-hernando-2025",
  "personalInfo": {
    "name": "Hernando Montoya Oliveros",
    "title": "Android Research & Development Engineer",
    "phone": "06.23.70.58.66",
    "email": "h.montoya2004@gmail.com",
    "website": "hernandomontoya.net",
    "profileImage": "https://customer-assets.emergentagent.com/job_responsive-vita/artifacts/x21fq5wh_profil.png"
  },
  "experiences": [
    {
      "id": "exp-1",
      "title": "Android Research & Development Engineer",
      "company": "ELTA System",
      "location": "Ashdod, Israel",
      "period": "2021 - Present",
      "period_es": "2021 - Presente",
      "period_fr": "2021 - Présent",
      "description": {
        "en": [
          "Lead development of advanced Android applications for defense systems",
          "Implement modern Android architecture patterns with MVVM and Clean Architecture",
          "Integrate cutting-edge technologies including Jetpack Compose and Kotlin Coroutines",
          "Collaborate with cross-functional teams to deliver high-quality mobile solutions"
        ],
        "es": [
          "Lidero el desarrollo de aplicaciones Android avanzadas para sistemas de defensa",
          "Implemento patrones de arquitectura Android modernos con MVVM y Clean Architecture",
          "Integro tecnologías de vanguardia incluyendo Jetpack Compose y Kotlin Coroutines",
          "Colaboro con equipos multifuncionales para entregar soluciones móviles de alta calidad"
        ],
        "fr": [
          "Dirige le développement d'applications Android avancées pour les systèmes de défense",
          "Implémente des modèles d'architecture Android modernes avec MVVM et Clean Architecture",
          "Intègre des technologies de pointe incluant Jetpack Compose et Kotlin Coroutines",
          "Collabore avec des équipes pluridisciplinaires pour livrer des solutions mobiles de haute qualité"
        ]
      }
    },
    {
      "id": "exp-2",
      "title": "Développeur Android Senior",
      "company": "Veepee",
      "location": "Full Remote",
      "period": "2020 - 2021",
      "period_es": "2020 - 2021",
      "period_fr": "2020 - 2021",
      "description": {
        "en": [
          "Developed the Veepee/Privalia application for a group present in several European countries",
          "Created new functionalities and integrated Jetpack Compose",
          "Corrected bugs and improved application performance",
          "Worked with agile methodologies and code review processes"
        ],
        "es": [
          "Desarrollé la aplicación Veepee/Privalia para un grupo presente en varios países europeos",
          "Creé nuevas funcionalidades e integré Jetpack Compose",
          "Corregí errores y mejoré el rendimiento de la aplicación",
          "Trabajé con metodologías ágiles y procesos de revisión de código"
        ],
        "fr": [
          "Développé l'application Veepee/Privalia pour un groupe présent dans plusieurs pays européens",
          "Créé de nouvelles fonctionnalités et intégré Jetpack Compose",
          "Corrigé des bugs et amélioré les performances de l'application",
          "Travaillé avec des méthodologies agiles et des processus de révision de code"
        ]
      }
    }
  ],
  "education": [
    {
      "id": "edu-1",
      "title": "M2 Technologies d'Internet pour les organisations",
      "institution": "Université Paris Dauphine-PSL",
      "year": "2007",
      "type": "degree"
    },
    {
      "id": "edu-2",
      "title": "Ingénieur de Systèmes",
      "institution": "Université de Cundinamarca, Colombie",
      "year": "2004",
      "type": "degree"
    },
    {
      "id": "edu-3",
      "title": "Android Developer Certification",
      "institution": "Google",
      "year": "2019",
      "type": "certification"
    }
  ],
  "skills": {
    "languages": ["Kotlin", "Java", "Python", "JavaScript", "Dart"],
    "android": ["Gradle", "Firebase", "Dagger2", "Dagger Hilt", "RxJava", "Coroutines", "Jetpack Compose", "Room", "ViewModels"],
    "tools": ["Android Studio", "VS Code", "Git", "Bitrise", "Docker", "CI/CD", "Jira"],
    "methodologies": ["MVVM", "UML", "Scrum", "Clean Architecture", "TDD", "Code Review"]
  },
  "languages": [
    {
      "name": "English",
      "level": "B2",
      "proficiency": 75
    },
    {
      "name": "Spanish",
      "level": "Native",
      "proficiency": 100
    },
    {
      "name": "French",
      "level": "Bilingual",
      "proficiency": 95
    }
  ],
  "aboutDescription": {
    "en": "Experienced Android developer with 13+ years in software development, specializing in modern Android development with Kotlin, Jetpack Compose, and cutting-edge mobile technologies. Passionate about creating innovative solutions that push the boundaries of mobile development. Strong background in defense systems and e-commerce applications.",
    "es": "Desarrollador Android experimentado con más de 13 años en desarrollo de software, especializado en desarrollo Android moderno con Kotlin, Jetpack Compose y tecnologías móviles de vanguardia. Apasionado por crear soluciones innovadoras que expanden los límites del desarrollo móvil. Gran experiencia en sistemas de defensa y aplicaciones de comercio electrónico.",
    "fr": "Développeur Android expérimenté avec plus de 13 ans en développement logiciel, spécialisé dans le développement Android moderne avec Kotlin, Jetpack Compose et les technologies mobiles de pointe. Passionné par la création de solutions innovantes qui repoussent les limites du développement mobile. Solide expérience dans les systèmes de défense et les applications e-commerce."
  },
  "updated_at": "2025-01-17T12:00:00.000Z"
}